# for i in [90,100,81,84,70,65]:
#  a=0 #a=0 代表不及格
#  b=1 #b=1代表优秀
#  if   (a<60):
#      print(i,"全是垃圾")
#  if   (b>80):
#    print(i,"优秀到爆炸")

# "01010010001110001001001010101010010101"计算下几个0 几个1
# a=0 #统计“0”的个数
# b=0 #统计“1”的个数
# # for i in "010100100011100010010010101010100101101":
# #     if (i=="0"):
# #         a=a+1
# #     else:
# #         b=b+1
# # print(a,b)
# n=1
# i=1
# while (i<=9):
#     n=n*i
#     i=i+1
# # print(n)
# a="我是你麻麻养你容易吗？"
# print(a[3:6])
# print(a[5:-2])
# #
# a="1,2,3,4,5,6,7,8,9"
# print(a[5])
# print(a[6:10])
# print(a[::-1])
# print(a[::2])
# print(a.split(","))
# print(a.replace("5","10"))